{
    "type": "query results",
    "query": "SELECT * FROM CSCI",
    "columns": [
        {
            "displayName": "Name",
            "name": "Name",
            "database": null,
            "table": "CSCI",
            "type": "STRING"
        },
        {
            "displayName": "Units",
            "name": "Units",
            "database": null,
            "table": "CSCI",
            "type": "STRING"
        },
        {
            "displayName": "Usually Offered In",
            "name": "Usually Offered In",
            "database": null,
            "table": "CSCI",
            "type": "STRING"
        },
        {
            "displayName": "Additional Information",
            "name": "Additional Information",
            "database": null,
            "table": "CSCI",
            "type": "STRING"
        },
        {
            "displayName": "Description",
            "name": "Description",
            "database": null,
            "table": "CSCI",
            "type": "STRING"
        }
    ],
    "rows": [
        [
            "CSCI 1. Critical Thinking and Computer Science",
            "Units: 3",
            "Fall \/ Spring",
            "GE Area: A3",
            "This will build up your critical thinking skills when it comes to computer science"
        ],
        [
            "CSCI 5. Computer and Applications",
            "Units: 3",
            "Fall \/ Spring",
            "",
            "You will learn about the makeup of a computer and the applications that come with it."
        ],
        [
            "CSCI 30. Introduction to the Internet",
            "Units: 3",
            "",
            "",
            "You be introducted to \"wonderful\" world of the Internet and what you can do with it."
        ],
        [
            "CSCI 39. Computer Science Principles",
            "Units: 3",
            "Fall \/ Spring",
            "",
            "This will teach students the ethics and procedures of what to expect when going into the field of computer science."
        ],
        [
            "CSCI 40. Introduction to Programming and Problem Solving",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "This will give an introduction to programming through C++ and go through the basic operations, functions, and fundimentals of programming hands on."
        ],
        [
            "CSCI 41. Introduction to Data Structures",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "This shall teach students more in depth programming skills using C++ in which comman data structors shall be learned such as class, queues, stacks, linked-lists, binary trees, and MORE!"
        ],
        [
            "CSCI 60. Foundations of Computer Science",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "This aim of this class is to learn about the foundations of that make up computer science such as logic, memory modeling functions, and so much more"
        ],
        [
            "CSCI 68. Computing Practice and Programming",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "This will teach students the best programming practices to use during their programming sessions to provide clean, effiecient code."
        ],
        [
            "CSCI 100. Introduction to Computational Science",
            "Units: 3",
            "Fall \/ Spring",
            "GE Area: IB",
            "This will teach students proper computations that are commonly used in the computer science field."
        ],
        [
            "CSCI 101. Computational Foundations for Bioinformatics",
            "Units: 3",
            "",
            "",
            "This will teach students about the computational foundations for bioinformatics."
        ],
        [
            "CSCI 108. Algorithmic Thinking",
            "Units: 4",
            "Spring",
            "",
            "This will teach students to thrink through their algorithms to better improve effiecenty and memory usage."
        ],
        [
            "CSCI 112. Introduction to Computer Systems",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "This will provide an introduction to computer systems at a deeper level using an assembly language to better understand registers and the use of logic gates."
        ],
        [
            "CSCI 113. Introduction to Computer Organization",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "This is sort of like CSCI 112 except that you will need to learn how to convert binary into decimal, decimal into hexidecimal, and how to convert any base number into a different system."
        ],
        [
            "CSCI 114. Introduction to Operating Systems",
            "Units: 3",
            "Fall \/ Spring",
            "",
            "AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!"
        ],
        [
            "CSCI 115. Algorithms and Data Structures",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "This will teach students advance algorithms and data structures such as hash tables, algorithms for searching, more advance binary search trees, how to use tuples, and many others."
        ],
        [
            "CSCI 117. Structures of Programming Languages",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "Pain and suffering await. You might think you're learning about programming enviormnets, garbage collection, how to manage memory efficient, and how to programming using logic. HOWEVER, this will be preparing for massive amounts of pain."
        ],
        [
            "CSCI 119. Introduction to Finite Automata",
            "Units: 4",
            "Fall \/ Spring",
            "",
            "Even more pain and suffering await. While this might be ment for introducing the idea of Finite State Machines, Regular Expressions, and Normal Forms, this will put missery in your soul through the programming language of Haskell. WARNING: DO NOT TAKE 119 AND 117 TOGETHER. THEY WILL NOT PLAY OFF EACH OTHER. IT WILL ONLY BE HELL!"
        ],
        [
            "CSCI 124. Introduction to File Processing",
            "Units: 3",
            "",
            "",
            "Learn how files are processed in the computer and how to properly parse them."
        ],
        [
            "CSCI 126. Database Systems",
            "Units: 3",
            "Spring",
            "",
            "This will teach you SQL and how to set up a database properly."
        ],
        [
            "CSCI 130. Web Programming",
            "Units: 3",
            "Fall",
            "",
            "You will learn different programming languages to use to make a website and work server side such as HTML5, CSS, and a bunch of others"
        ],
        [
            "CSCI 134. Compiler Design",
            "Units: 3",
            "",
            "",
            "Learn what it takes to make a compiler to parse data for the computer to understand."
        ],
        [
            "CSCI 146. Systems Architecture",
            "Units: 3",
            "",
            "",
            "Learn how the different parts of a system interaction."
        ],
        [
            "CSCI 148. Systems Programming",
            "Units: 3",
            "",
            "",
            "Learn how to code in the O\/S level."
        ],
        [
            "CSCI 150. Introduction to Software Engineering",
            "Units: 3",
            "Fall",
            "",
            "History, goals, and motivation of software engineering. Study and use of software engineering methods. Requirements, specification, design, implementation, testing, verification, and maintenance of large software systems. Team programming."
        ],
        [
            "CSCI 152E. Software Engineering",
            "Units: 3",
            "Spring",
            "",
            "This is like 150 except you have to make an actual working producted that is nice looking and completely fills out all requirments for the targeted user."
        ],
        [
            "CSCI 154. Simulation",
            "Units: 3",
            "Spring",
            "",
            "This will teach you how to model data in a simulated enviorment."
        ],
        [
            "CSCI 156. Internetworking Systems and Protocols",
            "Units: 3",
            "Fall",
            "",
            "Review of underlying network technologies. Application-level\ninterconnections, network architectures, addressing, mapping abstract addresses to physical addresses,\nrouting datagrams, error and control messages, protocol layering, gateways, subnets. Client-server\ninteractions. Upper layers of protocol stacks."
        ],
        [
            "CSCI 164. Artificial Intelligence Programming",
            "Units: 3",
            "Spring",
            "",
            "This will give the basics went it comes to programming Artificial Intelligence such as the history behind the field of A.I. and the different formulas that have allowed breakthroughs in this field."
        ],
        [
            "CSCI 166. Principles of Artificial Intelligence",
            "Units: 3",
            "Fall",
            "",
            "Artificial intelligence is intelligence demonstrated by machines. The \nrespective field of study focuses on the science needed to develop intelligent and \nautonomous agents. This course covers the principles of artificial intelligence. Topics \ninclude agent theory, optimization, unsupervised learning, supervised learning, and \nreinforcement learning. "
        ],
        [
            "CSCI 168E. Big Data Analytics",
            "Units: 3",
            "Fall",
            "",
            "You will work will large swaves of data in which you will learn to properly organize databases."
        ],
        [
            "CSCI 172. Computer Graphics",
            "Units: 3",
            "Fall",
            "",
            "You will learn how to work with matrixes, vectors, textures, and files to create 2D and 3D graphics right you computer by learning the fundiments of how OpenGL works through the language of C++"
        ],
        [
            "CSCI 173. Advanced Computer Graphics",
            "Units: 3",
            "Fall",
            "",
            "This will teach you not only on how to load data from a file to build graphics on a computer but it will also teach you how collision works, shaders work, different techinques for rendering 3D shapes, and even animations in the OpenGL & GLEW enviornment using C++ as the base codding language."
        ],
        [
            "CSCI 174. Design and Analysis of Algorithms",
            "Units: 3",
            "Fall",
            "",
            "This will teach you both how algorithms are formed as well as what makes an algorithm work at a base level."
        ],
        [
            "CSCI 176. Parallel Processing",
            "Units: 3",
            "Spring",
            "",
            "This will teach you what you can do with parallel processing and how it can be done."
        ],
        [
            "CSCI 177. Distributed Computer Systems",
            "Units: 3",
            "",
            "",
            "This will teach you how to work with a collections of computers for server-client, P2P, and hybrid relations"
        ],
        [
            "CSCI 186. Formal Languages and Automata",
            "Units: 3",
            "",
            "",
            "You will learn how to construct a language in a computer environment"
        ],
        [
            "CSCI 188. Introduction to Computability",
            "Units: 3",
            "",
            "",
            "You will learn what computability actually is and how to make it good."
        ],
        [
            "CSCI 190. Independent Study",
            "Units: 1-3",
            "",
            "Repeatable up to 6 units",
            "You will pick a topic in computer science, learn about it, and show how it works to an open group."
        ],
        [
            "CSCI 191T. Topics in Computer Science",
            "Units: 3",
            "",
            "Repeatable up to 9 units",
            "This is for hot topics that are in computer science"
        ],
        [
            "CSCI 191T. Computer Security",
            "Units: 3",
            "",
            "",
            "You will learn how to keep hackers out of your system, what to do encase of a malware attack, how to give permissions to certain users, and how to make a secure system."
        ],
        [
            "CSCI 194I. Cooperative Education",
            "Units: 1-4",
            "",
            "Repeatable up to 8 units",
            "You will learn with one another to learn something new in computer science"
        ],
        [
            "CSCI 198. Project",
            "Units: 3",
            "Fall \/ Spring",
            "",
            "You will make a project to show off to your fellow peers of your choosing."
        ],
        [
            "CSCI 200. Introduction to Research in Computer Science",
            "Units: 1",
            "Fall \/ Spring",
            "",
            "This will be the start of researching in computer science"
        ],
        [
            "CSCI 201. CSCI Colloquium",
            "Units: 2",
            "Fall \/ Spring",
            "",
            "....Again, I don't think anyone takes this...."
        ],
        [
            "CSCI 213. Computer Organization",
            "Units: 3",
            "",
            "",
            "You will learn how to organize your computer"
        ],
        [
            "CSCI 217. Programming Language Principles",
            "Units: 3",
            "Spring",
            "",
            "You will learn what to do universally when it comes to programming languages"
        ],
        [
            "CSCI 226. Advanced Database Systems",
            "Units: 3",
            "",
            "",
            "It's like the first batabase class except more"
        ],
        [
            "CSCI 230. Advanced Web Application Development",
            "Units: 3",
            "",
            "",
            "You will learn more about web application development to the point where you could work for the place that tought you this in the first place."
        ],
        [
            "CSCI 244. Operating Systems",
            "Units: 3",
            "",
            "",
            "You will learn how an operating system works and how to tinker around with it to get the best results"
        ],
        [
            "CSCI 246. Computer Architecture",
            "Units: 3",
            "Fall",
            "",
            "Learn what makes up a computer at the base level"
        ],
        [
            "CSCI 250. Advanced Software Engineering",
            "Units: 3",
            "",
            "",
            "CAN WE GET MUCH HIGHER? SO HIGH!"
        ],
        [
            "CSCI 252. Software Development and Environments",
            "Units: 3",
            "",
            "",
            "Learn how to make software and an enjoyible environment for your user."
        ],
        [
            "CSCI 253. Human-Computer Interaction",
            "Units: 3",
            "",
            "",
            "By god, you will learn how to be an ethical programmer and how to maintain health relations between computers and humans"
        ],
        [
            "CSCI 256. Wireless Communications and Mobile Computing",
            "Units: 3",
            "",
            "",
            "Learn how wireless communications and how to work with mobile devices"
        ],
        [
            "CSCI 264. Artificial Intelligence",
            "Units: 3",
            "",
            "",
            "This is for create actually artifical intelligence with supervised, unsupervised, and reinforcement learning."
        ],
        [
            "CSCI 272. Computer Graphics",
            "Units: 3",
            "",
            "",
            "Ray tracing and lighting is what you will learn"
        ],
        [
            "CSCI 274. Combinatorial Algorithms",
            "Units: 3",
            "",
            "",
            "Let's be real, no one has taken this course and anyone who says they have is a LIAR!"
        ],
        [
            "CSCI 282. Theory of Computation",
            "Units: 3",
            "",
            "",
            "You will learn what makes up a computation and what makes it a vaild compuation"
        ],
        [
            "CSCI 284. Automata Theory",
            "Units: 3",
            "",
            "",
            "Learn about how the deep theories in Nier: Automata"
        ],
        [
            "CSCI 290. Independent Study",
            "Units: 1-3",
            "",
            "Repeatable up to 6 units",
            "LEARNING ON YOUR OWWWWNNNNN"
        ],
        [
            "CSCI 291T. Seminar",
            "Units: 1-3",
            "",
            "Repeatable up to 9 units",
            "Get in a group "
        ],
        [
            "CSCI 291T. Introduction to Reinforcement Learning",
            "Units: 3",
            "",
            "",
            "You will learn how to teach an agent to do as you say as you train it rigerously will heavy selective data"
        ],
        [
            "CSCI 291T. Image Processing",
            "Units: 3",
            "",
            "",
            "You will leanr how to processes an image and what to do with that image once processed"
        ],
        [
            "CSCI 297. Grad Synthesis",
            "Units: 3",
            "Fall \/ Spring",
            "",
            "Consolidate that you are still learning computer science"
        ],
        [
            "CSCI 298. Research Project",
            "Units: 3",
            "",
            "",
            "You will personally research a project and demo it to a group of people"
        ],
        [
            "CSCI 298C. Project Continuation",
            "Units: 0",
            "",
            "",
            "If you've taken CSCI 298, it means it took longer than normal"
        ],
        [
            "CSCI 299. Master's Thesis",
            "Units: 3-6",
            "",
            "",
            "Really long paper on a topic of your choosing in the computer science field"
        ],
        [
            "CSCI 299C. Thesis Continuation",
            "Units: 0",
            "",
            "",
            "I mean really long paper on your topic of your choosing if you've already written up your master thesis"
        ]
    ]
}